yamaxgucci/esp32-os/sdkconfig.defaults.esp32
# ArgonOS - original ESP32 (Xtensa LX6), the hardware-only target.
#
# The primary platform is the S3; this target exists because the first real
# board in the project's hands is an ESP32-2432S028R ("cheap yellow display"):
# WROOM-32, 4 MB flash, NO PSRAM, ILI9341 240x320 on SPI, XPT2046 touch, SD on
# SPI, speaker on the built-in DAC.  Everything QEMU cannot answer - the level
# on a pin, a real bus transaction, a real cycle count - is answered here.
#
# What this target cannot do, and that is not a defect of the config: no PSRAM
# means no spike S-1 (execution from PSRAM), no megabyte .bss, and profile
# `lite` rather than `full`.  See docs/09-esp32-cyd.md.

CONFIG_IDF_TARGET="esp32"

# WROOM-32: 4 MB, DIO.  The 8 MB table does not fit - appfs would start past
# the end of the chip - so this target brings its own.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_4mb.csv"

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Frequency scaling, and this is the target where it belongs: the only one that
# links with it (the S3 image overflows its data segment by about a kilobyte),
# the only one with a battery connector on it, and the only one where the
# milliamps can be measured at all.
#
# Verified on the board 22 August 2026: the machine cruises to 160 MHz by
# itself at the prompt, `power eco` reaches 80, `esp_clk_cpu_freq` reports each
# of them, and the console survives every step - which is why the port offers
# 240/160/80 and not the crystal.  See docs/11-power.md.
CONFIG_ARGON_ENABLE_PM=y

# The code arena is instruction RAM, and on this chip that is SRAM0: 128 KB in
# total, shared with every IRAM-resident routine ESP-IDF puts there.  192 KB
# (the S3 figure) does not exist here at all.
#
# Eight, and it is the radios that decide it.  This number went 48 -> 40 -> 8
# as Wi-Fi and then Bluetooth were linked in, and the arena is what had to give
# because nothing else in that instruction RAM is optional.  It is also the
# thing no other firmware on this chip has: a slice of IRAM held in reserve so
# that an application image can be both written and executed in place.  A
# larger image is not refused - it relocates into the appfs partition and runs
# from flash instead, through the cache, which works and is slower.
#
# For measuring rather than for using the board, `argon target esp32-dsp`
# builds the same system with no radios and a 48 KB arena, which is what
# CKTBENCH wants: 36 KB of code, timed from RAM rather than through the cache.
# Sizes for a board with 208 KB and a radio, not for one with PSRAM.
#
# Measured on the CYD: an application taking the generic defaults leaves the
# machine with a largest free block of 5 KB, and at 5 KB the access point goes
# on beaconing while refusing every station - a WPA2 handshake has nowhere to
# happen.  The board is then unreachable with nothing in any log, and the phone
# says "wrong password".  The demo that showed it touches 4.3 KB of stack out
# of the sixteen it was handed.
#
# Eight is also the floor the loader itself runs on (AG_PROC_LOAD_STACK_MIN),
# so this is the smallest default that cannot break loading.  An image that
# needs more says so with AG_APP_SIZED and gets it - or is refused, which is
# the answer we want over a board that cannot be reached.
#
# Only the stack: the process arena is CONFIG_ARGON_APP_HEAP_KB, which has no
# Kconfig entry and so cannot be set from here at all.  ARGON_APP_ARENA_KB,
# which does exist, is the *code* arena an .AXE is relocated into - a different
# thing entirely, and lowering it by mistake only makes images fall back to
# flash XIP.
CONFIG_ARGON_APP_STACK_KB=8
CONFIG_ARGON_APP_ARENA_KB=8

# The radio takes its transmit buffers up front instead of asking for them
# when it needs them.
#
# Maxim's question, and the right one: if the memory is going to be needed
# anyway, why not take it at the start?  By default the driver keeps sixteen
# dynamic transmit buffers, allocated from the shared heap at the moment of
# use - which on this board is the moment there is nothing left, because an
# application is running.  Static buffers are taken during esp_wifi_init,
# before any application exists, and nothing can take them away.
#
# Eight rather than sixteen: each is about 1.6 KB, so this is ~13 KB claimed
# for good on a 208 KB machine.  That is memory applications no longer get,
# and that is the trade being made on purpose - a large application now fails
# to start, with a message, instead of starting and quietly cutting the board
# off the air.
#
# What this does NOT cover: the WPA2 handshake itself, which the supplicant
# allocates when a station appears.  There is no setting for that one.
# Four, not eight, and not the sixteen dynamic ones the default keeps.
#
# Eight static buffers cost ~13 KB taken for good, and that turned out to be
# the file manager's whole margin: it failed to start with "no memory for a
# 8192 byte task stack", having run perfectly well before.  What fixed the
# radio was the stack default, measured; these were added on top and never
# tested on their own, so they were paying rent in somebody else's room.
#
# Four keeps the point of the idea - the radio holds transmit memory that no
# application can take - at half the price, and leaves the room an application
# needs to exist at all.  A board that stays reachable and runs nothing is not
# the goal.
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=0
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=4

# Both radios, in one image.
#
# They were two builds for half a day, on the strength of a link failure that
# turned out to be the arena above rather than the radios.  Linked, they cost
# flash and about 25 KB of static RAM; *running*, Wi-Fi costs ~37 KB and
# Bluetooth ~54, and both at once leave 11 KB free, which is not a machine.  So
# neither starts unless something asks: [wifi] ssid or [bt] keyboard in
# SYSTEM.CFG, or `wifi on` / `bt on` at the prompt, and `off` gives it back.
CONFIG_ARGON_ENABLE_NET=y
CONFIG_ARGON_NET_WIFI=y
CONFIG_ARGON_ENABLE_BLE=y
CONFIG_ETH_USE_OPENETH=n

# Monitor mode and raw 802.11 injection, off by default because a board that
# forges frames is a build-time choice (Kconfig).  Turned on here because this
# is the board MARAUDER.AXE runs on, and its Wi-Fi sniffers and attacks are that
# capability: api->wifimon is NULL without it, and the app then says so and
# offers nothing to sniff.  The frame ring is allocated only while a capture is
# running; the static cost is small.
CONFIG_ARGON_NET_WIFI_MON=y

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# BLE only, and NimBLE rather than Bluedroid: the controller's classic half is
# handed back at start (about 30 KB), and NimBLE is roughly half of Bluedroid.
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
# Peripheral is on, and not by choice: the whole of ESP-IDF's NimBLE HID *host*
# is behind BT_NIMBLE_HID_SERVICE, whose menu depends on the GATT *server*.
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_GATT_SERVER=y
CONFIG_BT_NIMBLE_HID_SERVICE=y
# A keyboard is bonded once and remembered.  Without this it asks to be paired
# again after every power cut - and pairing is done from a keyboard.
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# A panic reboots rather than halting.
#
# Halting is right on a desk with a console attached: the message stays on the
# screen and can be read.  This board serves files to a phone, and a machine
# that stops answering with no way to ask it why is worse than one that comes
# back and says "reset: panic" on the next line.  The message is printed either
# way; this decides only what happens after it.
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=n

# The radio's buffers, sized for a chip whose whole internal memory is 320 KB.
# The defaults assume a part with PSRAM: static rx 10 and dynamic rx 32 alone
# are more than twenty kilobytes.  These are enough for a console, a file
# transfer and a PCM stream, and are the first thing to raise if throughput
# matters more than free memory.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# The radio's hot paths stay in flash rather than being copied into IRAM.
#
# Not a preference: with them in IRAM the image does not link at all, because
# IRAM on this chip is 128 KB, the kernel and the code arena already hold most
# of it, and these two options ask for about 28 KB more.  They buy throughput
# by keeping the receive path out of the flash cache; what they cost here is
# the ability to build.  If the arena is ever cut back, this is the first place
# to spend the room.
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# The host helper on UART1 does not exist on a board and never will; leaving
# HostFS in would spend 80 KB of DRAM on its buffers and 100 ms of every boot
# on a PING nobody answers.
CONFIG_ARGON_ENABLE_HOSTFS=n

# Analogue input, off everywhere else because linking esp_adc stops the boot
# under QEMU (trap 26).  This target is not verified under QEMU - it is the one
# place the ADC can finally be tried, and the board has a light sensor wired to
# GPIO34 to try it on.
CONFIG_ARGON_ENABLE_ADC=y

# Sound.  This part has two 8-bit converters of its own and this board wires
# GPIO26 - the second of them - to an amplifier and a speaker, which is the
# only way it can make a noise: there is no codec and no USB.  Off everywhere
# else because the S3 has no converters and QEMU has no DMA for them.
CONFIG_ARGON_ENABLE_AUDIO=y

CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Forty columns, because the screen soldered to this board is 320 pixels wide
# and the system draws 8-pixel cells: forty by thirty is what fits, and the
# console has to be what fits or half of every line is off the glass.  The
# serial console shows the same grid - it is one screen, rendered twice.
CONFIG_ARGON_CONSOLE_COLS=40
CONFIG_ARGON_CONSOLE_ROWS=25
